# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige werkcollege de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [1]:
import pandas as pd
import sqlite3 
import warnings
warnings.simplefilter('ignore')

Zet de volgende bestanden in een makkelijk te vinden map, als je dat nog niet gedaan hebt:
- go_sales.sqlite
- go_crm.sqlite
- go_staff.sqlite

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige werkcollege de code om een connectie met het bestand go_sales.sqlite te maken.

In [2]:
conn = sqlite3.connect("go_sales.sqlite")
print("Verbonden met database")

Verbonden met database

Lees van de ingelezen go_sales-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [4]:
sql_query = "SELECT * FROM product;"

dataFrame = pd.read_sql_query(sql_query, conn)

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt.<br> <u>Let op:</u> lees eventueel de informatie uit het vorige werkcollege nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [5]:
sql_query = "SELECT * FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in

pd.read_sql(sql_query, conn)

,type,name,tbl_name,rootpage,sql
0,table,country,country,480,"CREATE TABLE ""country"" (\n\t""COUNTRY_CODE""\tIN..."
1,table,order_details,order_details,11,"CREATE TABLE ""order_details"" (\n\t""ORDER_DETAI..."
2,table,order_header,order_header,24,"CREATE TABLE ""order_header"" (\n\t""ORDER_NUMBER..."
3,table,order_method,order_method,27,"CREATE TABLE ""order_method"" (\n\t""ORDER_METHOD..."
4,table,product,product,28,"CREATE TABLE ""product"" (\n\t""PRODUCT_NUMBER""\t..."
5,table,product_line,product_line,17,"CREATE TABLE ""product_line"" (\n\t""PRODUCT_LINE..."
6,table,product_type,product_type,10,"CREATE TABLE ""product_type"" (\n\t""PRODUCT_TYPE..."
7,table,retailer_site,retailer_site,18,"CREATE TABLE ""retailer_site"" (\n\t""RETAILER_SI..."
8,table,return_reason,return_reason,30,"CREATE TABLE ""return_reason"" (\n\t""RETURN_REAS..."
9,table,returned_item,returned_item,31,"CREATE TABLE ""returned_item"" (\n\t""RETURN_CODE..."
10,table,sales_branch,sales_branch,2,"CREATE TABLE ""sales_branch"" (\n\t""SALES_BRANCH..."
11,table,sales_staff,sales_staff,3,"CREATE TABLE ""sales_staff"" (\n\t""SALES_STAFF_C..."

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [6]:
dataFrame.loc[dataFrame["PRODUCTION_COST"].between(50, 100),
              ['PRODUCT_NAME', 'PRODUCTION_COST']]

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [7]:
dataFrame.loc[
    (dataFrame["MARGIN"] > 0.60) |
    (dataFrame["MARGIN"] < 0.20),
    ['PRODUCT_NAME', 'MARGIN']]

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [8]:
sql_query = "SELECT * FROM country"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame["CURRENCY_NAME"] == "francs"].sort_values("COUNTRY")

    COUNTRY_CODE      COUNTRY LANGUAGE CURRENCY_NAME
15            17      Belgium       EN        francs
0              1       France       EN        francs
7              8  Switzerland       EN        francs

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [9]:
sql_query = "SELECT * FROM product"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame["MARGIN"] > 0.50,
    ["INTRODUCTION_DATE"]
].drop_duplicates(subset="INTRODUCTION_DATE")

    INTRODUCTION_DATE
66         2000-10-26
85         1995-02-15
101        2003-12-10
103        2003-12-18
104        2003-12-27
106        2004-01-13
110        2003-12-15

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [10]:
sql_query = "SELECT * FROM sales_branch"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame['ADDRESS2'].notnull() &
    dataFrame['REGION'].notnull(),
    ['ADDRESS1', 'CITY']
]

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [11]:
sql_query = "SELECT * FROM country"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame["CURRENCY_NAME"].str.contains("dollar")].sort_values("COUNTRY")

    COUNTRY_CODE        COUNTRY LANGUAGE CURRENCY_NAME
14            16      Australia       EN       dollars
3              4         Canada       EN       dollars
11            12         Taiwan       EN    new dollar
2              3  United States       EN       dollars

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [12]:
sql_query = "SELECT * FROM retailer_site"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame['POSTAL_ZONE'].str.match("D-") &
    dataFrame['ADDRESS2'].notnull(),
    ['ADDRESS1', 'ADDRESS2', 'CITY']
]

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [13]:
sql_query = "SELECT * FROM returned_item"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.shape[0]
#of print(len(dataFrame)))

619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [14]:
sql_query = "SELECT * FROM sales_branch"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.drop_duplicates('REGION').shape[0]
#Of print(len(dataFrame.drop_duplicates('REGION')))

16

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [15]:
sql_query = "SELECT * FROM product;"

dataFrame = pd.read_sql_query(sql_query, conn)

minimum = dataFrame['MARGIN'].min()
maximum = dataFrame['MARGIN'].max()
average = round(dataFrame['MARGIN'].mean(), 2) #Bij round ,2 krijg ik 1 decimaal, bij round ,3 krijg ik er wel 3 (waarschijnlijk omdat het afgerond .40 is)

print("Min: ", minimum)
print("Max: ", maximum)
print("Avg: ", average)

Min:  0.17
Max:  0.7
Avg:  0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [16]:
sql_query = "SELECT * FROM retailer_site"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame['ADDRESS2'].isnull()
].shape[0]

286

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [17]:
sql_query = "SELECT * FROM order_details"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.loc[
    dataFrame['UNIT_PRICE'] > dataFrame['UNIT_SALE_PRICE'],
    ['UNIT_SALE_PRICE']
].mean()

UNIT_SALE_PRICE    180.437137
dtype: float64

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [18]:
sql_query = "SELECT * FROM sales_staff"
dataFrame = pd.read_sql_query(sql_query, conn)

dataFrame.groupby('POSITION_EN').size().reset_index(name='AANTAL')

                    POSITION_EN  AANTAL
0                Branch Manager      19
1              District Manager       4
2               General Manager       1
3  Level 1 Sales Representative      13
4  Level 2 Sales Representative      39
5  Level 3 Sales Representative      24
6              Regional Manager       2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [19]:
aantal_per_nummer = dataFrame.groupby('WORK_PHONE').size().reset_index(name='AANTAL')
aantal_per_nummer[aantal_per_nummer['AANTAL'] > 4]

             WORK_PHONE  AANTAL
4     +(44) 121 3505267       5
10  +(61) 03 2982  4242       5
11  +31 (0)20 692 93 94       5
13    +33 1 68 94 52 20       5
18     1 (206) 292-0012       5
19     1 (305) 557-4810       6
20     1 (310) 281-5722       5
21     1 (403) 232-5986       5
22     1 (416) 493-5595       5
23     1 (617) 268-6754       6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [8]:
sql_query_country = "SELECT * FROM country"
sql_query_retailer_site = "SELECT * FROM retailer_site"
country = pd.read_sql_query(sql_query_country, conn)
retailer_site = pd.read_sql_query(sql_query_retailer_site, conn)

countryMerge = pd.merge(retailer_site, country, on='COUNTRY_CODE')

countryMerge.loc[
    countryMerge['COUNTRY']  == 'Netherlands',
    ['ADDRESS1', 'CITY']
]

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [9]:
sql_query_product = 'SELECT * FROM product'
sql_query_product_type = 'SELECT * FROM product_type'
product = pd.read_sql_query(sql_query_product, conn)
product_type = pd.read_sql_query(sql_query_product_type, conn)

productAndType = pd.merge(product, product_type, on="PRODUCT_TYPE_CODE")

productAndType.loc[
    productAndType['PRODUCT_TYPE_EN'] == 'Eyewear',
    ['PRODUCT_NAME']
]

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [10]:
sql_query_order_header = 'SELECT * FROM order_header'
sql_query_sales_staff = 'SELECT * FROM sales_staff'

order_header = pd.read_sql(sql_query_order_header, conn)
#retailer_site heb ik al aangemaakt in een van de vorige opgaves
sales_staff = pd.read_sql(sql_query_sales_staff, conn)

triple_merge = order_header.merge(
    retailer_site,
    on="RETAILER_SITE_CODE",
    how="left"
).merge(
    sales_staff,
    on="SALES_STAFF_CODE",
    how="left"
)

triple_merge.loc[
    triple_merge['POSITION_EN'] == 'Branch Manager',
    ['ADDRESS1', 'FIRST_NAME', 'LAST_NAME']
].drop_duplicates('ADDRESS1')

                  ADDRESS1 FIRST_NAME LAST_NAME
3185  Alameda Santos, 9876     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [12]:
sales_staff = pd.read_sql_query(sql_query_sales_staff, conn)
order_header = pd.read_sql_query(sql_query_order_header, conn)

verkoperDatum = sales_staff.merge(order_header, on="SALES_STAFF_CODE", how="left")

verkoperDatum.loc[
    verkoperDatum['POSITION_EN'].str.contains("Manager", na=False),
    ['ORDER_DATE','POSITION_EN']
].drop_duplicates()

      ORDER_DATE       POSITION_EN
0            NaN    Branch Manager
320          NaN  Regional Manager
648          NaN  District Manager
3748  2024-09-09    Branch Manager
3749  2024-03-13    Branch Manager
3750  2024-01-09    Branch Manager
4186         NaN   General Manager

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [14]:
order_details = pd.read_sql_query("SELECT * FROM order_details", conn)

df = order_details.merge(product, on="PRODUCT_NUMBER", how="left") \
                  .merge(product_type, on="PRODUCT_TYPE_CODE", how="left")

df.loc[
    df["QUANTITY"] > 750,
    ["PRODUCT_NAME", "PRODUCT_TYPE_EN"]
    ].drop_duplicates()

                PRODUCT_NAME    PRODUCT_TYPE_EN
539        BugShield Extreme  Insect Repellents
1759                Star Peg              Tents
20121  BugShield Lotion Lite  Insect Repellents
20147         Sun Shelter 15          Sunscreen
20152         Sun Shelter 30          Sunscreen
31236        BugShield Spray  Insect Repellents
37272              Firefly 2           Lanterns
37348       BugShield Lotion  Insect Repellents
37363             Sun Shield          Sunscreen

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

In [15]:
df = order_details.merge(product, on="PRODUCT_NUMBER", how="left")

df["DISCOUNT"] = (df["UNIT_PRICE"] - df["UNIT_SALE_PRICE"]) / df["UNIT_PRICE"]

df.loc[
    df["DISCOUNT"] > 0.40,
    ["PRODUCT_NAME"]
    ].drop_duplicates()

                      PRODUCT_NAME
506              BugShield Natural
511                BugShield Spray
650   Hailstorm Titanium Woods Set
2797         BugShield Lotion Lite
2836                Sun Shelter 30
3751             BugShield Extreme
5074                Sun Shelter 15
6930              BugShield Lotion

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

In [17]:
returned_item = pd.read_sql_query("SELECT * FROM returned_item", conn)
return_reason = pd.read_sql_query("SELECT * FROM return_reason", conn)

df = (
    returned_item
    .merge(order_details, on="ORDER_DETAIL_CODE", how="left")
    .merge(return_reason, on="RETURN_REASON_CODE", how="left")
)

df.loc[
    (df["RETURN_QUANTITY"] / df["QUANTITY"]) > 0.90,
    ["RETURN_DESCRIPTION_EN"]
    ].drop_duplicates()

    RETURN_DESCRIPTION_EN
0  Unsatisfactory product
2   Wrong product shipped
3   Wrong product ordered

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

In [19]:
df = product.merge(product_type, on="PRODUCT_TYPE_CODE", how="left")

df.groupby("PRODUCT_TYPE_EN").size().reset_index(name="AANTAL_PRODUCTEN")

         PRODUCT_TYPE_EN  AANTAL_PRODUCTEN
0             Binoculars                 4
1   Climbing Accessories                 7
2           Cooking Gear                10
3                Eyewear                 5
4              First Aid                 5
5       Golf Accessories                 4
6      Insect Repellents                 5
7                  Irons                 4
8                 Knives                 5
9               Lanterns                12
10            Navigation                 4
11                 Packs                 6
12               Putters                 3
13                  Rope                 4
14                Safety                 4
15         Sleeping Bags                 7
16             Sunscreen                 5
17                 Tents                 6
18                 Tools                 6
19               Watches                 5
20                 Woods                 4

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

In [20]:
df = retailer_site.merge(country, on="COUNTRY_CODE", how="left")

df.groupby("COUNTRY").size().reset_index(name="AANTAL_VESTIGINGEN")

           COUNTRY  AANTAL_VESTIGINGEN
0        Australia                  10
1          Austria                  10
2          Belgium                  10
3           Brazil                   1
4           Canada                  31
5            China                  10
6          Denmark                   6
7          Finland                   5
8           France                  29
9          Germany                  32
10           Italy                  12
11           Japan                  25
12           Korea                  10
13          Mexico                  10
14     Netherlands                  20
15           Spain                   9
16          Sweden                  12
17     Switzerland                  13
18          Taiwan                  10
19  United Kingdom                  25
20   United States                 101

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (6 kolommen, 10 rijen)

In [21]:
df = (
    order_details
    .merge(product, on="PRODUCT_NUMBER", how="left")
    .merge(product_type, on="PRODUCT_TYPE_CODE", how="left")
)

df.loc[df["PRODUCT_TYPE_EN"] == "Cooking Gear"].groupby("PRODUCT_NAME").agg(
          TOTAAL_VERKOCHT=("QUANTITY", "sum"),
          GEMIDDELDE_PRIJS=("UNIT_SALE_PRICE", "mean")
      ).reset_index().sort_values("TOTAAL_VERKOCHT", ascending=False)

                PRODUCT_NAME  TOTAAL_VERKOCHT  GEMIDDELDE_PRIJS
9        TrailChef Water Bag            36738          6.032506
2              TrailChef Cup            27418          6.976490
0          TrailChef Canteen            26544         11.979418
6      TrailChef Kitchen Kit            22206         22.345975
8         TrailChef Utensils            13776         17.294151
4     TrailChef Double Flame            12476        132.672882
1         TrailChef Cook Set            10878         51.687926
5           TrailChef Kettle             8826         12.201235
7     TrailChef Single Flame             8504         63.827622
3  TrailChef Deluxe Cook Set             3110        121.217638

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

In [22]:
sales_branch = pd.read_sql_query("SELECT * FROM sales_branch", conn)
verkoper = sales_branch.merge(country, on="COUNTRY_CODE", how="left")

klanten = (
    retailer_site.merge(country, on="COUNTRY_CODE", how="left")
    .groupby("COUNTRY")["CITY"]
    .nunique()
    .reset_index(name="klanten")
)

verkoper.merge(klanten, on="COUNTRY", how="left").rename(columns={"CITY": "verkoper"})[["COUNTRY", "verkoper", "klanten"]]

           COUNTRY          verkoper  klanten
0           France             Paris       14
1            Italy            Milano        9
2      Netherlands         Amsterdam       15
3          Germany           Hamburg       18
4          Germany           München       18
5           Sweden             Kista       10
6           Canada           Calgary       16
7           Canada           Toronto       16
8    United States            Boston       62
9    United States           Seattle       62
10   United States       Los Angeles       62
11   United States             Miami       62
12          France              Lyon       14
13          Mexico  Distrito Federal        6
14           Japan             Tokyo        5
15           Japan        Osaka City        5
16       Australia         Melbourne        6
17           Spain            Bilbao        5
18          Brazil         São Paulo        1
19         Finland            Kuopio        5
20           Korea             Seoul        6
21          Taiwan         San Chung        9
22           China          Shanghai        7
23  United Kingdom            London        9
24  United Kingdom        Birmingham        9
25     Switzerland            Zürich        9
26         Belgium          Heverlee        8
27         Austria              Wien        9

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

In [23]:
df = sales_staff.merge(
    order_header,
    on="SALES_STAFF_CODE",
    how="left"
)


df.loc[
    df["ORDER_NUMBER"].isna(),
    ["FIRST_NAME", "LAST_NAME"]
    ].drop_duplicates()

     FIRST_NAME      LAST_NAME
0         Denis           Pagé
320        Else         Mörike
321       Frank          Fuchs
647       Fritz         Hirsch
648        Jörg          Kunze
728       Maria      Iacobucci
946        Kick        Kalkman
1309      Karin      Bergström
1395      Sally          White
1421      Frank        Bretton
1422    Georges  Saint-Germain
1719       Alex      Rodriguez
2088   Samantha          Floyd
2392      Julie          Olsen
2530      Corey         Wright
2873    Estelle        Johnson
2874       Greg        Belding
2999      Julie        Béchard
3157      Lucía          Reyna
3401     Kazumi        Uragome
3559      Alice         Walter
4185     Walter         Taylor
4186   Penelope        Tamrine
4349      Polly         Linton
4590      Gracy        Gellens

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

In [24]:
df = order_details.merge(product, on="PRODUCT_NUMBER", how="left")

df["MARGIN"] = (df["UNIT_SALE_PRICE"] - df["UNIT_COST"]) / df["UNIT_SALE_PRICE"]

avg_margin_all = df["MARGIN"].mean()

lower_margin = df[df["MARGIN"] < avg_margin_all]

pd.DataFrame({
    "RESULTAAT": [
        lower_margin["PRODUCT_NUMBER"].nunique(),
        lower_margin["MARGIN"].mean()
    ]
})

    RESULTAAT
0  110.000000
1    0.275973

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

In [25]:
df = order_details.merge(product, on="PRODUCT_NUMBER", how="left")

returned_products = returned_item["ORDER_DETAIL_CODE"].unique()

df.loc[
    (df["UNIT_SALE_PRICE"] > 500) &
    (~df["ORDER_DETAIL_CODE"].isin(returned_products)),
    ["PRODUCT_NAME"]
    ].drop_duplicates()

                           PRODUCT_NAME
88                            Star Dome
95                         Star Gazer 2
103                        Star Gazer 3
112                        Star Gazer 6
616               Hailstorm Steel Irons
625            Hailstorm Titanium Irons
634          Lady Hailstorm Steel Irons
641       Lady Hailstorm Titanium Irons
647        Hailstorm Titanium Woods Set
657           Hailstorm Steel Woods Set
665   Lady Hailstorm Titanium Woods Set
674      Lady Hailstorm Steel Woods Set
1104                     Husky Rope 200

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

In [27]:
manager_col = []

for positie in sales_staff["POSITION_EN"]:
    if "Manager" in positie:
        manager_col.append("Ja")
    else:
        manager_col.append("Nee")

sales_staff["Manager"] = manager_col

print(sales_staff[["LAST_NAME", "Manager"]])

     LAST_NAME Manager
0         Pagé      Ja
1       Michel     Nee
2     Clermont     Nee
3       Jauvin     Nee
4    Wiesinger     Nee
..         ...     ...
97    Laermans     Nee
98     De Crée     Nee
99     Lattrez     Nee
100  Seefelder     Nee
101     Grüner     Nee

[102 rows x 2 columns]

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [24]:
from datetime import date
date.today().year

2026

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [18]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 30 jaar in dienst) of een ‘lang in dienst’ (groter dan gelijk aan 30 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

In [33]:
from datetime import date, datetime

jaar = date.today().year

dienst_col = []

for hire_date in sales_staff["DATE_HIRED"]:
    date_obj = datetime.strptime(hire_date, "%Y-%m-%d")
    
    jaren_in_dienst = jaar - date_obj.year
    
    if jaren_in_dienst < 30:
        dienst_col.append("kort in dienst")
    else:
        dienst_col.append("lang in dienst")

sales_staff["DIENST"] = dienst_col

print(sales_staff[["LAST_NAME", "DIENST"]])

     LAST_NAME          DIENST
0         Pagé  lang in dienst
1       Michel  lang in dienst
2     Clermont  kort in dienst
3       Jauvin  kort in dienst
4    Wiesinger  kort in dienst
..         ...             ...
97    Laermans  kort in dienst
98     De Crée  kort in dienst
99     Lattrez  kort in dienst
100  Seefelder  kort in dienst
101     Grüner  kort in dienst

[102 rows x 2 columns]